# parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, spdFFA, [32]],  # 1
   [-1, 1, Conv, [64, 3, 1]],           #####2
   [-1, 1, spdFFA, [64]], #####3
   
    
   [-1,1,PCVSSBcommonv20spaffaNet,[256,64,256]], ######4


   [-1, 1, MP, []],                   #####5
   [-1, 1, Conv, [128, 1, 1]],        #####6
   [-3, 1, Conv, [128, 1, 1]],        #####7
   [-1,1,spdFFA,[128]],           #####8
   [[-1, -3], 1, Concat, [1]],  # 9-P3/8

  [-1,1,PCVSSBcommonv20spaffaNet,[512,128,512]],         ###10
  

   [-1, 1, MP, []], #####11
   [-1, 1, Conv, [256, 1, 1]], #####12
   [-3, 1, Conv, [256, 1, 1]], #####13
   [-1,1,spdFFA,[256]],  #####14
   [[-1, -3], 1, Concat, [1]],  # 15-P4/16

[-1,1,PCVSSBcommonv20spaffaNet,[1024,256,1024]],         ###16
 

   [-1, 1, MP, []],              #####17
   [-1, 1, Conv, [512, 1, 1]], #####18
   [-3, 1, Conv, [512, 1, 1]], #####19
   [-1,1,spdFFA,[512]],  #####20
   [[-1, -3], 1, Concat, [1]],  # 21-P5/32

   [-1,1,PCVSSBcommonv20spaffaNet,[1024,256,1024]],          ###22
 
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # #####23

   [-1, 1, Conv, [256, 1, 1]], #####24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #####25
   [16, 1, Conv, [256, 1, 1]], # route backbone P4 #####26
   [[-1, -2], 1, Concat, [1]],  #####27
   ###################################################1111111111111111111111111111111111111
   [-1, 1, PCVSSBcommonv20EEspaffaNet, [256,128,256]],    ######28
 

   [-1, 1, Conv, [128, 1, 1]],                 #####29
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #####30
   [10, 1, Conv, [128, 1, 1]], # route backbone P3 #####31
   [[-1, -2], 1, Concat, [1]],                     #####32
###########################################################################22222222222222222222222222222
 [-1, 1, PCVSSBcommonv20EEspaffaNet, [128,64,128]] ,                #####33


   [-1, 1, MP, []],                            #####34
   [-1, 1, Conv, [128, 1, 1]],                 #####35
   [-3, 1, Conv, [128, 1, 1]],                #####36
   [-1,1,spdFFA,[128]],                 #####37
   #[-1,1,space_to_depth,[1]],  # 1-P1/2
   [[-1, -3, 28], 1, Concat, [1]],          #####38
##############################################################333333333333333333333333333
   [-1, 1, PCVSSBcommonv20EEspaffaNet, [256,128,256]] ,              #39


   [-1, 1, MP, []],                #####40
   [-1, 1, Conv, [256, 1, 1]], #####41
   [-3, 1, Conv, [256, 1, 1]], #####42
   [-1,1,spdFFA,[256]],  #####43
   [[-1, -3, 23], 1, Concat, [1]],   #####44
################################################################################4444444444444444444444444444
  [-1, 1, PCVSSBcommonv20EEspaffaNet, [512,256,512]], #45


   [33, 1, RepConv, [256, 3, 1]], #####46
   [39, 1, RepConv, [512, 3, 1]], #####47
   [45, 1, RepConv, [1024, 3, 1]], #####48

   [[46,47,48], 1, IDetect, [nc, anchors]],   # 97 Detect(P3, P4, P5)
  ]
